## Redis 笔记-03

> ##
> #### 目录
> 1. 命令行客户端
> 2. 发送命令
> 3. 命令返回值
> ##

---

##### 1. 命令行客户端

redis-cli(Redis Command Line Interface) 是Redis自带的基于命令行的Redis客户端。

---

##### 2. 发送命令

通过redis-cli向Redis发送命令有两种方式。

##### 1）将命令作为redis-cli的参数执行

例如
```
redis-cli SHUTDOWN
```

redis-cli执行时会自动按照默认配置(服务器地址为127.0.0.1,端口号为6379)连接Redis，通过-h和-p参数可以自定义地址和端口号
```
redis-cli -h 127.0.0.1 -p 6379
```

Redis提供了PING命令来测试客户端与Redis的连接是否正常
```
redis-cli PING
PONG
```

如果正常连接会返回PONG

##### 2）不附带参数运行redis-cli，这方式会进入交互模式，可以自由输入命令

```
redis-cli
> PING
PONG
> ECHO hi
"hi"
```

---

##### 3. 命令返回值

在大多数情况下，执行一条命令后我们往往会关心命令的返回值，Redis对于命令的返回值有5种类型，对于每种类型redis-cli的展现结果都不同。

> 状态回复

状态回复（status reply）是最简单的一种回复，比如向Redis发送SET命令设置某个键的值时，Redis会回复状态OK表示设置成功。例如PING-PONG，表示连接状态成功。

> 错误回复

当出现命令不存在或命令格式有错误等情况时Redis会返回错误回复（error reply）。错误回复以（error）开头，并在后面跟上错误信息。

例如执行一个不存在的命令
```
> ERRORCOMMEND
(error) ERR unknown command 'ERRORCOMMEND'
```

> 整数回复

Redis虽然没有整数类型，但是却提供了一些用于整数操作的命令，如递增键值的 <b>INCR</b> 命令会以整数形式返回递增后的键值。除此之外，一些其他命令也会返回整数，如可以获取当前数据库中键的数量的 <b>DBSIZE</b> 命令等。整数回复（integer reply）以（integer）开头，并在后面跟上整数数据

```
> INCR baz
(integer) 1
```

> 字符串回复

字符串回复（bulk reply）是最常见的一种回复类型，当请求一个字符串类型键的键值或一个其他类型键中的某个元素时就会得到一个字符串回复。字符串回复以双引号包裹

```
> GET foo
"1"
```

特殊情况是当请求的键值不存在时会得到一个空结果，显示为（null）。

```
> GET noexists
(nil)
```

> 多行字符串回复

多行字符串回复（multi-bulk reply）同样很常见，如当请求一个非字符串类型键的元素列表时就会收到多行字符串回复。多行字符串回复中的每行字符串都以一个序号开头

```
> KEYS *
1) "bar"
2) "foo"
3) "baz"
```

KEYS命令的作用是获取数据库中复合制定规则的键名
